{
  "_name_or_path": "/Users/neurowelt/.cache/huggingface/hub/models--nichijoufan777--stable-diffusion-xl-base-0.9/snapshots/6ac8e91d911ef6c3b5be08441b74fa3ffc085de0/text_encoder_2",
  "architectures": [
    "CLIPTextModelWithProjection"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "dropout": 0.0,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_size": 1280,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "intermediate_size": 5120,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 77,
  "model_type": "clip_text_model",
  "num_attention_heads": 20,
  "num_hidden_layers": 32,
  "pad_token_id": 1,
  "projection_dim": 1280,
  "torch_dtype": "float32",
  "transformers_version": "4.30.2",
  "vocab_size": 49408
}
